#### Terraform Apply 🎬`success`

<details><summary>Show Result</summary>

```

terraform
aws_ecr_repository.app_container_repo: Refreshing state... [id=demo-fargate-app]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole]
data.aws_security_group.ecs: Reading...
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
data.aws_vpc.vpc: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=demo-fargate-app-ecsTaskRole]
aws_cloudwatch_log_group.log-group: Refreshing state... [id=demo-fargate-app-logs]
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f]
data.aws_security_group.ecs: Read complete after 0s [id=sg-0a4da3a6cadecdb46]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole-20230116161620443900000002]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-09588034d45d4bae9]
data.aws_subnets.subnets: Reading...
aws_lb_target_group.alb_ecs_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230116161619809000000001/18aa39592593ee28]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
aws_lb_listener_rule.listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/tf-lb-20230116125743651400000008/908d01a8ba2edfb0/cbaae90a9c597e5f/6f83dee41c11cc28]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:369168831564:cluster/ecs-fargate"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "demo-fargate-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "demo-fargate-app"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/tf-20230116161619809000000001/18aa39592593ee28"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a4da3a6cadecdb46",
            ]
          + subnets          = [
              + "subnet-05bbd722c95dce46e",
              + "subnet-069f38a28c0fd50b1",
              + "subnet-0e744c5ae26360bdc",
            ]
        }
    }

  # aws_ecs_task_definition.task_def will be created
  + resource "aws_ecs_task_definition" "task_def" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "369168831564.dkr.ecr.us-east-1.amazonaws.com/demo-fargate-app:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "demo-fargate-app-logs"
                          + awslogs-region        = ""
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "demo-fargate-app"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::369168831564:role/demo-fargate-app-ecsTaskExecutionRole"
      + family                   = "demo-fargate-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "demo"
        }
      + task_role_arn            = "arn:aws:iam::369168831564:role/demo-fargate-app-ecsTaskRole"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecs_task_definition.task_def: Creating...
aws_ecs_task_definition.task_def: Creation complete after 0s [id=demo-fargate-app]
aws_ecs_service.service: Creating...
aws_ecs_service.service: Creation complete after 1s [id=arn:aws:ecs:us-east-1:369168831564:service/ecs-fargate/demo-fargate-app]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>
